{
  "backend/main.mo": "Motoko canister managing sessions, outputs, and layers with CRUD operations and simple state tracking for active streams.",
  "feature_evidence.json": "Metadata listing feature requirements, related files, components, and confidence for multiple frontend enhancements.",
  "frontend-file-summaries.txt": "Prewritten summaries of many frontend source files for build and documentation reference.",
  "frontend/index.css": "Empty stylesheet placeholder for global styles.",
  "frontend/index.html": "Base HTML page loading the React app via main.tsx with a root container.",
  "frontend/src/App.tsx": "Sets up TanStack Router with routes for sessions list and session detail pages.",
  "frontend/src/components/AppLayout.tsx": "Defines the global layout with header navigation, main content outlet, and footer branding.",
  "frontend/src/components/LayersPanel.tsx": "UI panel for listing and adding stream overlay layers with loading and error states.",
  "frontend/src/components/OutputsList.tsx": "Displays streaming outputs with copy-to-clipboard actions and error/loading handling.",
  "frontend/src/components/PlatformTargetForm.tsx": "Form for selecting a streaming platform, validating fields, and submitting output target configuration to a session.",
  "frontend/src/components/QuickStartDialog.tsx": "Multi‑step dialog for quickly creating a session, selecting video source, and configuring an output platform, with preset import support.",
  "frontend/src/components/SessionForm.tsx": "Simple form to create a new session by entering a title and triggering the createSession mutation.",
  "frontend/src/components/StreamHealthPanel.tsx": "Displays stream readiness checks, network information, and YouTube verification state for a session.",
  "frontend/src/components/StreamKeyNotice.tsx": "Static alert explaining stream‑key storage and recommending extra security for production.",
  "frontend/src/components/VideoSourcePanel.tsx": "Panel for viewing, editing, and saving a session’s video source URL with Google Drive warnings when applicable.",
  "frontend/src/features/sessions/api.ts": "Thin wrappers around backend actor methods for sessions, outputs, video sources, and layers.",
  "frontend/src/features/sessions/mutations.ts": "React Query mutations for creating, starting, stopping sessions, adding outputs, and setting video sources with toast feedback and cache updates.",
  "frontend/src/features/sessions/queries.ts": "Defines React Query hooks to fetch sessions, outputs, and layers from the backend actor, including batch queries and active session listing.",
  "frontend/src/hooks/useActor.ts": "Creates and manages a backend actor based on the user's identity and invalidates related queries when the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides Internet Identity context, handles login and identity restoration, and manages AuthClient configuration.",
  "frontend/src/index.css": "Tailwind base stylesheet defining light/dark theme CSS variables and global styles.",
  "frontend/src/lib/fireplaceTitles.ts": "Generates random fireplace-themed session titles using adjective, noun, and time lists.",
  "frontend/src/lib/googleDriveLinks.ts": "Detects Google Drive share links and provides guidance on required sharing permissions.",
  "frontend/src/lib/presetImport.ts": "Parses Google-Docs-style preset text blocks into structured stream presets and reports formatting errors.",
  "frontend/src/lib/quickStartStorage.ts": "Stores and retrieves last-used session title and video URL in local storage for quick-start workflows.",
  "frontend/src/lib/youtubeVerificationStorage.ts": "Manages per-session YouTube verification data in local storage, including status and timestamps.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClientProvider and InternetIdentityProvider.",
  "frontend/src/pages/SessionDetailPage.tsx": "Displays session details, allows starting/stopping streams, and shows panels for outputs, video source, layers, and stream health.",
  "frontend/src/pages/SessionsPage.tsx": "Renders the sessions list with loading/error states and dialogs for creating or quick-starting streaming sessions.",
  "frontend/src/platforms/registry.ts": "Implements a registry storing platform adapters and exposes lookup and enumeration helpers.",
  "frontend/src/platforms/types.ts": "Defines types for platform adapters, platform fields, and validation results.",
  "frontend/src/platforms/validation.ts": "Validates platform field values against adapter rules, including required checks and basic URL/number validation.",
  "frontend/src/platforms/youtubeAdapter.ts": "Provides the YouTube platform adapter with required RTMP fields and defaults.",
  "frontend/tailwind.config.js": "Configures Tailwind theme, colors, animations, and plugins for the frontend UI.",
  "project_state.json": "Describes the project’s high-level goals, architecture notes, features, and versioned state."
}