{
  "backend/main.mo": "Actor implementing session, output, and layer management with CRUD operations and session start/stop logic.",
  "backend/migration.mo": "Migration module converting old session data to the new format with video source and layers fields.",
  "feature_evidence.json": "Feature evidence report mapping product features to frontend files, components, and test IDs.",
  "frontend-file-summaries.txt": "Prewritten summaries describing purposes of all frontend source files.",
  "frontend/index.css": "Empty placeholder stylesheet.",
  "frontend/index.html": "HTML entry point mounting the React app and loading main.tsx.",
  "frontend/src/App.tsx": "Configures the TanStack Router and defines routes for sessions list and session details.",
  "frontend/src/components/AppLayout.tsx": "Shared layout with header navigation, routed content area, and footer.",
  "frontend/src/components/LayersPanel.tsx": "UI panel for viewing and adding ordered visual layers for a session using queries and mutations.",
  "frontend/src/components/OutputsList.tsx": "Displays streaming outputs for a session with copy actions, error/loading states, and stream key notice.",
  "frontend/src/components/PlatformTargetForm.tsx": "Form component for selecting a streaming platform, validating platform-specific fields, and creating an output target for a session.",
  "frontend/src/components/QuickStartDialog.tsx": "Multi-step dialog for quickly creating a session, configuring a video source, and adding an output target.",
  "frontend/src/components/SessionForm.tsx": "Simple form for creating a new session with a title using react-hook-form and session creation mutation.",
  "frontend/src/components/StreamKeyNotice.tsx": "Alert component warning users about storing stream keys and suggesting stronger security for production.",
  "frontend/src/components/VideoSourcePanel.tsx": "Panel for viewing and updating a session's video source URL with validation and mutation handling.",
  "frontend/src/features/sessions/api.ts": "Wrapper functions around backend actor methods for sessions, outputs, layers, and video source operations.",
  "frontend/src/features/sessions/mutations.ts": "React Query mutations for session operations like create, start, stop, add output, and set video source with toast feedback.",
  "frontend/src/features/sessions/queries.ts": "React Query hooks for fetching sessions, outputs, and layers individually or in batches through the backend actor.",
  "frontend/src/hooks/useActor.ts": "Hook that initializes and caches a backend actor based on the user's identity and invalidates dependent queries on change.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication, including loading, logging in, and clearing identities. Wraps AuthClient setup with configurable options and exposes login state helpers.",
  "frontend/src/index.css": "Defines Tailwind base layers and OKLCH-based theme variables for light and dark modes. Applies global background, foreground, and border styles.",
  "frontend/src/main.tsx": "Bootstraps the React app, wrapping it with React Query and InternetIdentityProvider. Imports global styles and renders the App component.",
  "frontend/src/pages/SessionDetailPage.tsx": "Displays details for a specific streaming session, allowing start/stop actions, configuration management, and error/loading states. Integrates multiple panels for outputs, video source, and layers.",
  "frontend/src/pages/SessionsPage.tsx": "Lists active streaming sessions with loading/error handling and provides dialogs for quick start and creating new sessions. Enables navigation to individual session pages.",
  "frontend/src/platforms/registry.ts": "Maintains a registry of platform adapters, preloading the YouTube adapter. Provides lookup and enumeration of registered platforms.",
  "frontend/src/platforms/types.ts": "Defines types for platform adapters, including field definitions and validation result structures. Specifies metadata needed to configure streaming targets.",
  "frontend/src/platforms/validation.ts": "Validates platform adapter field values, checking required fields, URL validity, and number constraints. Returns a keyed map of validation errors.",
  "frontend/src/platforms/youtubeAdapter.ts": "Defines the YouTube platform adapter with RTMP fields such as ingest URL, stream key, and bitrate. Provides default metadata and field configurations.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom OKLCH-based theme colors, typography, animations, and plugins. Sets container rules, font families, and extended utilities.",
  "project_state.json": "Defines the current project state, including goals for multistreaming, platform adapters, YouTube integration, media sources, and overlay composition, plus a list of existing implemented features. Serves as the authoritative record for architectural notes, versions, and requirements."
}